/* ------------------ */
/* Variables          */
/* ------------------ */

let admin;
let nickName;

nickName = "John";
admin = nickName;

alert(admin);

let planet_name = "earth";
let onlineuser_name;









/* 다음 내용을 분석한 후, 프로그래밍 할 수 있도록 변수와 상수를 작성해봅니다. ----------- */

// 1- 갯수 별 상품 가격 계산하기
// 2- 구매 제품 가격의 총 합
// 3- 1년 기준 일(day)자 수 365일
// 4- 구매 결제 여부
// 5- 구매 결제 내역
// 6- 브랜드 접두사
// 7- 오늘의 운세
// 8- 상품 정보


/* variables ----------------------------------------------------------- */
// 1,2,4,5,6,7,8

/* constant variables -------------------------------------------------- */
// 3
